# Preprocessing

## Initial Inspection

In [1]:
import pandas as pd

path = "../data/"
data = pd.read_excel(path+"raw/WIID_19Dec2018.xlsx")
data.head()

,id,country,c3,c2,year,gini_reported,q1,q2,q3,q4,...,median_usd,gdp_ppp_pc_usd2011,population,revision,quality,quality_score,source,source_detailed,source_comments,survey
0,1,Afghanistan,AFG,AF,2008,29.00,9.00,13.00,17.00,22.00,...,NaN,1298.0,27294031.0,New 2013,High,12,National statistical authority,European Commission and the Government of Afgh...,National Risk and Vulnerability Assessment,NaN
1,2,Albania,ALB,AL,1996,27.01,9.15,13.70,17.73,23.29,...,1982.0,4812.0,3092228.0,New 2018,Average,13,World Bank,World Bank 2018,PovcalNet,NaN
2,3,Albania,ALB,AL,2002,31.74,8.35,12.58,16.49,22.21,...,1902.0,6316.0,3119029.0,New 2018,Average,13,World Bank,World Bank 2018,PovcalNet,NaN
3,4,Albania,ALB,AL,2005,30.60,8.40,12.90,17.03,22.50,...,2217.0,7563.0,3079179.0,New 2018,Average,13,World Bank,World Bank 2018,PovcalNet,NaN
4,5,Albania,ALB,AL,2008,29.98,8.87,13.07,16.83,22.23,...,2385.0,9018.0,2991651.0,New 2018,Average,13,World Bank,World Bank 2018,PovcalNet,NaN

In [2]:
print(data.shape)
print(data.columns)

(11101, 55)
Index(['id', 'country', 'c3', 'c2', 'year', 'gini_reported', 'q1', 'q2', 'q3',
       'q4', 'q5', 'd1', 'd2', 'd3', 'd4', 'd5', 'd6', 'd7', 'd8', 'd9', 'd10',
       'bottom5', 'top5', 'resource', 'resource_detailed', 'scale',
       'scale_detailed', 'sharing_unit', 'reference_unit', 'areacovr',
       'areacovr_detailed', 'popcovr', 'popcovr_detailed', 'region_un',
       'region_un_sub', 'region_wb', 'eu', 'oecd', 'incomegroup', 'mean',
       'median', 'currency', 'reference_period', 'exchangerate', 'mean_usd',
       'median_usd', 'gdp_ppp_pc_usd2011', 'population', 'revision', 'quality',
       'quality_score', 'source', 'source_detailed', 'source_comments',
       'survey'],
      dtype='object')

In [3]:
i = 11
data.iloc[:10, i:i+10]

     d1    d2    d3    d4    d5    d6     d7     d8     d9    d10
0   NaN   NaN   NaN   NaN   NaN   NaN    NaN    NaN    NaN    NaN
1  3.86  5.29  6.38  7.32  8.38  9.35  10.82  12.47  14.90  21.22
2  3.49  4.86  5.84  6.74  7.65  8.84  10.23  11.98  14.93  25.44
3  3.48  4.92  5.98  6.92  7.99  9.04  10.37  12.13  14.83  24.34
4  3.73  5.14  6.09  6.98  7.91  8.92  10.30  11.93  14.54  24.46
5  3.66  5.19  6.14  7.03  8.08  9.26  10.52  12.29  14.89  22.93
6  2.70  3.84  4.87  5.87  6.90  8.03   9.40  11.24  14.34  32.81
7  2.87  4.09  5.22  6.33  7.48  8.76  10.29  12.34  15.73  26.89
8  4.05  5.31  6.36  7.31  8.24  9.23  10.39  11.90  14.36  22.86
9   NaN   NaN   NaN   NaN   NaN   NaN    NaN    NaN    NaN    NaN

In [4]:
i = 21
data[["bottom5", "top5"]].iloc[:10]

   bottom5  top5
0      NaN   NaN
1      NaN   NaN
2      NaN   NaN
3      NaN   NaN
4      NaN   NaN
5      NaN   NaN
6      NaN   NaN
7      NaN   NaN
8      NaN   NaN
9      NaN   NaN

In [5]:
data["resource"].unique()

array(['Consumption', 'Income (net/gross)', 'Income (net)', 'Earnings',
       'Income (gross)', nan], dtype=object)

In [6]:
data["resource_detailed"].unique()

array(['Consumption', 'Income, net/gross', 'Monetary income, net',
       'Primary income', 'Income, gross', 'Income, net', 'Market income',
       'Earnings, gross', 'Monetary income, gross',
       'Taxable income, gross', 'Taxable income, net', 'Earnings, net',
       'Monetary income', 'Earnings', 'Factor income',
       'Monetary income, net (excluding property income)',
       'Income/consumption', 'Taxable income, excluding property income',
       'Taxable income, gross (including deductions)'], dtype=object)

In [7]:
data[["resource", "resource_detailed"]].value_counts()

resource            resource_detailed
Income (net)        Income, net                                         3671
Income (net/gross)  Income, net/gross                                   2329
Income (gross)      Income, gross                                       1656
Consumption         Consumption                                         1572
Earnings            Market income                                        530
                    Earnings, gross                                      489
Income (net)        Monetary income, net                                 218
Earnings            Taxable income, gross                                152
Income (gross)      Monetary income, gross                               148
Earnings            Earnings, net                                        139
                    Primary income                                        69
                    Taxable income, net                                   65
                    Factor income                                         25
Income (net/gross)  Monetary income                                       19
Earnings            Earnings                                               9
Income (net)        Monetary income, net (excluding property income)       7
Earnings            Taxable income, gross (including deductions)           1
                    Taxable income, excluding property income              1
Name: count, dtype: int64

In [8]:
data[data["resource"] == "Consumption"]["resource_detailed"].unique()

array(['Consumption'], dtype=object)

In [9]:
data["resource"].value_counts()

resource
Income (net)          3896
Income (net/gross)    2348
Income (gross)        1804
Consumption           1572
Earnings              1480
Name: count, dtype: int64

In [10]:
data[["resource", "resource_detailed"]].isna().sum()

resource             1
resource_detailed    0
dtype: int64

In [11]:
data["resource_detailed"].unique()

array(['Consumption', 'Income, net/gross', 'Monetary income, net',
       'Primary income', 'Income, gross', 'Income, net', 'Market income',
       'Earnings, gross', 'Monetary income, gross',
       'Taxable income, gross', 'Taxable income, net', 'Earnings, net',
       'Monetary income', 'Earnings', 'Factor income',
       'Monetary income, net (excluding property income)',
       'Income/consumption', 'Taxable income, excluding property income',
       'Taxable income, gross (including deductions)'], dtype=object)

In [12]:
data["scale_detailed"].unique()

array(['Per capita', 'Equivalized', 'No adjustment', nan,
       'Family per capita', 'Family equivalized, OECD', 'OECD-modified',
       'OECD', 'Economic family equivalized, square root',
       'Family equivalized, square root',
       'Census family equivalized, square root', 'Family equivalized',
       'Household equivalized, social assistance', 'Tax unit per capita',
       'National scale', '1988 revised Jensen scale',
       'Family equivalized, social assistance',
       'Family equivalized, national scale',
       'Tax unit equivalized, square root', '1977 McClements scale',
       'Head of household'], dtype=object)

In [13]:
data["scale"].unique()

array(['Per capita', 'Equivalized', 'No adjustment', nan], dtype=object)

In [14]:
data[["scale", "scale_detailed"]].value_counts()

scale          scale_detailed
Per capita     Per capita                                  4812
Equivalized    Equivalized                                 2665
No adjustment  No adjustment                               2157
Equivalized    OECD-modified                                659
Per capita     Family per capita                             93
Equivalized    1977 McClements scale                         43
               Family equivalized, social assistance         25
               Economic family equivalized, square root      22
Per capita     Head of household                             22
Equivalized    National scale                                20
               Household equivalized, social assistance      15
               1988 revised Jensen scale                     12
               OECD                                          11
               Family equivalized, square root                9
               Census family equivalized, square root         8
               Family equivalized, national scale             8
               Family equivalized                             7
               Family equivalized, OECD                       4
Per capita     Tax unit per capita                            3
Equivalized    Tax unit equivalized, square root              1
Name: count, dtype: int64

In [15]:
data[["sharing_unit", "reference_unit"]].value_counts()

sharing_unit  reference_unit
Household     Person            8431
              Household         1338
Person        Person             768
Tax unit      Tax unit            49
Family        Person               6
Household     Family               2
Tax unit      Person               2
Name: count, dtype: int64

In [16]:
data[["scale", "scale_detailed", "sharing_unit", "reference_unit"]].value_counts().sort_index()

scale          scale_detailed                            sharing_unit  reference_unit
Equivalized    1977 McClements scale                     Household     Person              43
               1988 revised Jensen scale                 Household     Person              12
               Census family equivalized, square root    Household     Person               8
               Economic family equivalized, square root  Household     Person              22
               Equivalized                               Household     Household            8
                                                                       Person            2657
               Family equivalized                        Household     Person               7
               Family equivalized, OECD                  Household     Person               4
               Family equivalized, national scale        Household     Person               8
               Family equivalized, social assistance     Household     Person              25
               Family equivalized, square root           Household     Person               9
               Household equivalized, social assistance  Household     Person              15
               National scale                            Household     Person              20
               OECD                                      Household     Person              11
               OECD-modified                             Household     Person             659
               Tax unit equivalized, square root         Tax unit      Person               1
No adjustment  No adjustment                             Household     Family               2
                                                                       Household         1330
                                                                       Person               8
                                                         Person        Person             768
                                                         Tax unit      Tax unit            49
Per capita     Family per capita                         Household     Person              93
               Head of household                         Household     Person              22
               Per capita                                Family        Person               6
                                                         Household     Person            4805
               Tax unit per capita                       Household     Person               2
                                                         Tax unit      Person               1
Name: count, dtype: int64

In [33]:
data[["scale", "scale_detailed", "sharing_unit", "reference_unit"]].value_counts().shape[0]

27

In [18]:
data[["scale", "scale_detailed", "sharing_unit", "reference_unit"]].value_counts().sort_index().to_csv(path+"processed/scales.csv")

In [23]:
data["areacovr"].value_counts()

areacovr
All      9359
Urban    1000
Rural     633
Part      109
Name: count, dtype: int64

In [22]:
data[["areacovr", "areacovr_detailed"]].value_counts()

areacovr  areacovr_detailed
All       All                                                                             9226
Urban     Urban                                                                            849
Rural     Rural                                                                            612
Part      West Germany                                                                      74
Urban     Capital                                                                           61
          Metropolitan area                                                                 42
All       Without rural north                                                               40
          With rural north                                                                  24
Part      East Germany                                                                      22
Rural     Agricultural sector                                                               19
All       All, excl. Transnistria                                                           18
Urban     Nonagricultural sector                                                            18
All       All, excl. some special areas (4% of the population)                              12
          Continental Portugal                                                               9
Urban     Cities (n=7)                                                                       7
          Cities                                                                             5
          All, mainly urban areas                                                            5
Part      Nonmetropolitan area                                                               5
All       All, excl. Costa Rural, Selva Rural and Selva Urbana (30% of the population)       4
Urban     Paramaribo and Wanica                                                              4
All       All, excl. West Irian and East Timor                                               4
          All, excl. East Timor                                                              4
          Main island                                                                        4
          All, excl. Abkhasia and Tskhinvali                                                 3
          All, excl. northern and eastern provinces                                          3
          All, excl. East-Central State                                                      2
Urban     Urban, excl. metropolitan area                                                     2
All       All, excl. West Irian, East Timor and Maluku                                       2
          All, excl. eight districts in the north and the east (15% of the population)       2
Part      Estate sector                                                                      2
Urban     Cities (n=4)                                                                       2
Part      Six northern provinces                                                             2
All       All, excl. nomadic areas                                                           1
          All, excl. seven districts                                                         1
Part      Four areas                                                                         1
          Peninsular Malaysia                                                                1
          Java                                                                               1
Rural     Four rural areas                                                                   1
Part      Three cantons                                                                      1
Rural     Rural, excl. seven districts on national level                                     1
Urban     Cities (n=17)                                                                      1
          Cities (n=16)                                                                      1
          Cities (n=8)                                                                       1
          Urban, excl. Western Province                                                      1
          Urban, excl. seven districts on national level                                     1
Name: count, dtype: int64

In [24]:
data["popcovr"].value_counts()

popcovr
All                    9882
Specific categories     751
Economically active     468
Name: count, dtype: int64

In [25]:
data[["popcovr", "popcovr_detailed"]].value_counts()

popcovr              popcovr_detailed
All                  All                                                  9882
Economically active  Employed                                              154
                     Income recipients                                     123
Specific categories  Males, aged 20+                                       119
Economically active  Taxpayers                                              96
                                                                          ...
Specific categories  Employed, private sector                                1
                     Income recipients, public sector                        1
                     Non-estate sector                                       1
                     Self-employed households                                1
                     Taxpayers, permanently employed and self-employed       1
Name: count, Length: 82, dtype: int64

In [28]:
data["region_un"].value_counts()

region_un
Europe      4416
Americas    3531
Asia        2165
Africa       634
Oceania      355
Name: count, dtype: int64

In [29]:
data[["region_un", "region_un_sub"]].value_counts()

region_un  region_un_sub
Americas   South America                1606
Europe     Northern Europe              1501
           Eastern Europe               1111
Americas   Central America               965
Europe     Western Europe                928
           Southern Europe               876
Asia       Eastern Asia                  700
Americas   Northern America              674
Asia       Southern Asia                 506
           Western Asia                  419
           South-eastern Asia            403
Oceania    Australia and New Zealand     322
Americas   Caribbean                     286
Africa     Eastern Africa                221
           Western Africa                175
Asia       Central Asia                  137
Africa     Northern Africa                98
           Southern Africa                87
           Middle Africa                  53
Oceania    Melanesia                      22
           Micronesia                      7
           Polynesia                       4
Name: count, dtype: int64

In [30]:
data[["areacovr", "areacovr_detailed", "popcovr", "popcovr_detailed", "region_un", "region_un_sub"]].value_counts().shape[0]

281

In [32]:
data[["eu", "oecd"]].value_counts()

eu      oecd
Non-EU  Non-OECD    5379
EU      OECD        3224
Non-EU  OECD        2096
EU      Non-OECD     402
Name: count, dtype: int64

In [34]:
data["incomegroup"].value_counts()

incomegroup
High income            6116
Upper middle income    3053
Lower middle income    1653
Low income              279
Name: count, dtype: int64

In [44]:
data[["mean", "median", "mean_usd", "median_usd"]].isna().sum() / data.shape[0]

mean          0.478786
median        0.592829
mean_usd      0.851004
median_usd    0.851365
dtype: float64

In [58]:
data[["country", "currency"]].groupby("country").nunique().sort_index(ascending=False)

                    currency
country
Zimbabwe                   3
Zambia                     2
Yugoslavia                 1
Yemen                      1
West Bank and Gaza         1
...                      ...
Angola                     2
Andorra                    1
Algeria                    1
Albania                    1
Afghanistan                1

[189 rows x 1 columns]

In [64]:
data[["currency", "reference_period", "exchangerate"]].head()

         currency reference_period  exchangerate
0  Afghan afghani            Month     50.249615
1      US$2011PPP             Year    104.498917
2      US$2011PPP             Year    140.154516
3      US$2011PPP             Year     99.870254
4      US$2011PPP             Year     83.894604

In [61]:
data[["currency", "reference_period", "exchangerate"]].isna().sum()

currency            4389
reference_period    4325
exchangerate         966
dtype: int64

In [69]:
data[["country", "gdp_ppp_pc_usd2011", "population"]].head()

       country  gdp_ppp_pc_usd2011  population
0  Afghanistan              1298.0  27294031.0
1      Albania              4812.0   3092228.0
2      Albania              6316.0   3119029.0
3      Albania              7563.0   3079179.0
4      Albania              9018.0   2991651.0

In [70]:
print(data["country"].isna().sum())
print(data["gdp_ppp_pc_usd2011"].isna().sum())
print(data["population"].isna().sum())

0
3409
58

In [92]:
countries_with_pop = data[data["population"].notna()]["country"].unique()
countries_without_pop = data[data["population"].isna()]["country"].unique()

print(countries_with_pop[:10])
print(countries_without_pop)

print([c for c in countries_without_pop if c in countries_with_pop])
print([c for c in countries_without_pop if c not in countries_with_pop])

['Afghanistan' 'Albania' 'Algeria' 'Andorra' 'Angola' 'Argentina'
 'Armenia' 'Australia' 'Austria' 'Azerbaijan']
['Australia' 'Denmark' 'Germany' 'Guatemala' 'Israel' 'Italy' 'Japan'
 'Kenya' 'Netherlands' 'Soviet Union' 'Sweden' 'United Kingdom'
 'United States' 'Zimbabwe']
['Australia', 'Denmark', 'Germany', 'Guatemala', 'Israel', 'Italy', 'Japan', 'Kenya', 'Netherlands', 'Soviet Union', 'Sweden', 'United Kingdom', 'United States', 'Zimbabwe']
[]

In [99]:
data["revision"].unique()

array(['New 2013', 'New 2018', nan, 'New 2007', 'New 2008', 'New 2017'],
      dtype=object)

In [97]:
data[data["population"].isna()]["revision"].isna().sum()

np.int64(27)